function showLovePoem() {
    var name = document.getElementById('nameInput').value.toLowerCase().trim();
    var lovePoems = [
        "هاجر ❤️ في عيونها يسكن السحر، وقلبها ينبض بالحب.",
        "هاجر 🌹 زهرة هاجر تفتح ألوان السعادة في يومي.",
        "هاجر 🌟 عندما تبتسم هاجر، يزهر العالم بالجمال.",
        "هاجر 😊 عينا هاجر تضيء لي الحياة بضيائها.",
        "هاجر 🌈  هي قوس المطر في يوم ممطر.",
        "هاجر 🎵 صوت هاجر يغني للحياة بجماله.",
        "هاجر 💞  تملأ قلبي بالحب والسعادة.",
        "هاجر 🌷  هي زهرة الحب والعطاء.",
        "هاجر 🌺  تزهر كزهرة الربيع في قلبي.",
        "هاجر 🌞  تشعل يومي بأشعتها الدافئة.",
        "هاجر 🌼  تزهر كزهرة اللوتس في بحيرة الحب.",
        "هاجر 💖  تملأ قلبي بالحنان والاهتمام.",
        "هاجر 🌠  تلمع كنجمة ساطعة في سماء الحب.",
        "هاجر 🌻  تمطر قلبي بأمطار السعادة.",
        "هاجر 💫  تشعل حياتي بنورها الساطع.",
        "هاجر 🌺  تزهر في قلبي كزهرة الزنبق.",
        "هاجر 😄 عندما تبتسم هاجر، يزهر العالم بفرح.",
        "هاجر 💞  تملأ قلبي بالحب والأمل.",
        "هاجر 🌻  هي زهرة الصداقة والحب.",
        "هاجر 🌞  تشبه الشمس التي تضيء حياتي.",
        "هاجر 🎶 صوت  يملأ أذني بالألحان الجميلة.",
        "هاجر 🌷  هي عبارة عن باقة زهور جميلة.",
        "هاجر 🌹  هي وردة الحب التي تزين حياتي.",
        "هاجر 🌸  هي زهرة العشق والإخلاص.",
        "هاجر 😍  تجعلني أحلم بالسعادة والحب.",
        "هاجر 💓  هي مصدر الإلهام والعاطفة.",
        "هاجر 😊  تمنحني سببًا للابتسام والسعادة.",
        "هاجر 🌈  تضيء حياتي بألوان القوس الملون.",
        "هاجر 🌟  هي نجمة لامعة في سماء حياتي.",
        "هاجر 💖  هي مصدر الحب والسعادة في قلبي."
    ];
    

    if (name === 'هاجر' || name === "hajar") {
        var randomIndex = Math.floor(Math.random() * lovePoems.length);
        var selectedPoem = lovePoems[randomIndex];
        document.getElementById('lovePoem').textContent = selectedPoem;
    } else {
        document.getElementById('lovePoem').textContent = `لم تكب هده لهادا الأسم  ${name} `;
    }
}
